-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Час створення: Лют 09 2024 р., 18:34
-- Версія сервера: 10.4.32-MariaDB
-- Версія PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База даних: `travel`
--

-- --------------------------------------------------------

--
-- Структура таблиці `places`
--

CREATE TABLE `places` (
  `id` int(11) NOT NULL,
  `title` varchar(100) NOT NULL,
  `description` text NOT NULL,
  `article` text NOT NULL,
  `img` text NOT NULL,
  `fon` text NOT NULL,
  `location` text NOT NULL,
  `feedback_id` int(11) NOT NULL,
  `gallery_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп даних таблиці `places`
--

INSERT INTO `places` (`id`, `title`, `description`, `article`, `img`, `fon`, `location`, `feedback_id`, `gallery_id`) VALUES
(1, 'Гусятинська синагога ', 'Збудована орієнтовно на початку XVII ст. Є найцікавішою пам\'яткою Гусятина, що збереглася до наших днів.', 'Історія.Межа XVI – XVII століть – час бурхливих воєн і повстань, коли землі Галичини, переходячи з рук в руки, були розмінною монетою у військово-економічних союзах і конфронтаціях. Тому кожен великий архітектурний об’єкт, будь то релігійний центр чи магнатська резиденція, зводився як ланка єдиного ланцюга міських оборонних споруд з усіма витікаючими з цього архітектурними особливостями.Синагога в центрі Гусятина – селищі міського типу однойменного району, а колись міста з магдебурзьким правом (з 1559 року) – не була винятком. Створена в кінці XVI століття за сприяння роду Калиновських, вона служила релігійним і культурним центром єврейської громади міста, що сягала трьох тисяч осіб, інтереси якої і була покликана захищати, виступаючи в якості самостійного оборонного центру в разі прориву міської оборони.Зараз Синагога занепадає, двері її розкриті всім вітрам, а склепіння – дощам та снігам, крім того, внутрішні приміщення притягують варварів, які прагнуть привнести свою лепту в руйнування пам’ятника.  \r\n', 'img/синагога.jpg\r\n', 'img/Fon/синагога.jpg', 'селеще Гусятин вул.Героїв Майдану 49.07325357251714, 26.2085902635661', 0, 0),
(2, 'Костел Святого Антонія', 'У 1610 році Олександр Валентій Калиновський збудував у Гусятині дерев\'яні костел для отців-бернардинів.', 'Костел Святого Антонія\r\n\r\nпід час ремонту\r\nФундатор дерев\'яного костелу в Гусятині — дідич міста Валентій Александер Калиновський. Кам\'яний храм було споруджено його сином — польним коронним гетьманом Марціном Каліновським. Під час Хмельниччини костел було зруйновано.\r\n\r\nЗгідно з рішенням Тернопільської обласної ради народних депутатів від 5 березня 1992 року будівля передана віруючим РКЦ.', 'img/костел.jpg', 'img/Fon/Костел.jpg', 'селище Гусятин вул.Суходільська 49.06981423454151, 26.204452248717832', 0, 0),
(3, 'Сидорівський замок', 'Точний час його побудови невідомий, але традиційно прийнято вважати, що твердиню збудовано у 1640-х роках.', 'Сидорівський замок, також відомий як \"Замок-корабель\", - це мальовнича руїна, розташована на річці Збруч у селі Сидорів Тернопільської області. Його витягнута форма, що нагадує корабель, робить його унікальним серед інших замків України.Замок був збудований у 40-х роках XVII століття Марціном Калиновським, відомим чернігівським воєводою. Завдяки своєму розташуванню на острові, оточеному річкою та глибокими ровами, замок був неприступним для ворожих військ.Протягом своєї історії замок пережив багато битв. У 1672 році він був захоплений турками, але згодом відвойований польськими військами. У 1699 році замок знову зазнав руйнувань під час турецько-татарської навали.', 'img/замок.jpg\r\n', 'img/Fon/Сидорів.jpg', 'село Сидорів 49.00749364193816, 26.17027755069625', 0, 0),
(4, 'Хоростківський палацовий комплекс', '', 'Хоростківський палацовий комплекс перлина Тернопільщини. Хоростківський палацовий ком плекс – це не просто архітектурна пам\'ятка XVIII століття, а справжня перлина Тернопільщини. Розташований у мальовничому місті Хоростків, він протягом століть чарує відвідувачів своєю величчю, красою та таємничою атмосферою.Історія Хоростківського палацового комплексу сягає 1720-х років, коли на замовлення гетьмана Станіслава Потоцького було збудовано старий палац. Ця двоповерхова будівля з ризалітами та мансардним дахом вражає елегантним поєднанням ренесансу та раннього бароко. Її фасади оздоблені вишуканими ліпнинами, а інтер\'єри колись були прикрашені розписами та дорогимимеблями. У 1830-х роках за проектом італійського архітектора Боточчі збудовано новий палац. Ця триповерхова будівля з колонним портиком та багатством декору стала справжнім шедевром класицизму та ампіру. Її просторі зали вражали розкішшю інтер\'єрів, люстрами, камінами та картинами відомих художників.\r\nНавколо палаців розкинувся величний парк, який колись сягав 18 гектарів. Його мальовничі алеї, каскадні ставки, скульптури та старі дерева створювали атмосферу спокою та гармонії.', 'img/Хоростків.jpg', 'img/Fon/Хоростків.jpg', 'місто Хоростків 49.214458181150185, 25.928332538222843', 0, 0);

--
-- Індекси збережених таблиць
--

--
-- Індекси таблиці `places`
--
ALTER TABLE `places`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для збережених таблиць
--

--
-- AUTO_INCREMENT для таблиці `places`
--
ALTER TABLE `places`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
